Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/mems.tmx
Source language: ca
Languages: es_es

source: La conclusió era que només després de conéixer les arrels del problema, podria estudiar-se la realització d'un sistema de TA real.
es_es: La conclusión era que sólo después de conocer las raíces del problema, podría estudiarse la realización de un sistema de TA real.

source: La creació i el manteniment d'una bona base de dades terminològica requereix un gran esforç i moltes hores de treball.
es_es: La creación y el mantenimiento de una buena base de datos terminológica requiere un gran esfuerzo y muchas horas de trabajo.

source: La definició inclou, per tant, el tractament i la producció de missatges no textuals (orals).
es_es: La definición incluye, por lo tanto, el tratamiento y la producción de mensajes no textuales (orales).

source: La desambiguació més probable (la més versemblant) és l'elegida.
es_es: La desambiguación más probable (la más verosímil) es la elegida.

source: La figura mostra un diagrama de blocs del traductor.
es_es: La figura muestra un diagrama de bloques del traductor.

source: La idea fonamental es que el procés de traducció es pot fer sovint consultant traduccions anteriors i identificant frases o grups de mots en el corpus ja traduït.
es_es: La idea fundamental es que el proceso de traducción se pueda hacer a menudo consultando traducciones anteriores e identificando frases o grupos de palabras en el corpus ya traducido.

source: La informació de cada terme (en l'exemple només un) s'inclou dins de l'element { termEntry}, que conté descripcions (descrip) sobre el domini d'ús i la definició del terme, a més d'una secció { langSet} per a cada idioma (ací, anglés i hongarés) on s'especifica el terme (term) i informació sobre ell (termNote).
es_es: La información de cada término (en el ejemplo sólo uno) se incluye dentro del elemento { termEntry}, que contiene descripciones (descrip) sobre el dominio de uso y la definición del término, además de una sección { langSet} para cada idioma (aquí, inglés y húngaro) donde se especifica el término (term) e información sobre él (termNote).

source: La major part d'aquestes estacions de treball estan disponibles per a ordinadors personals.
es_es: La mayor parte de estas estaciones de trabajo están disponibles para ordenadores personales.

source: La major part del discutit en aquest apartat està pres dels treballs de John Hutchins, especialment de i .
es_es: La mayor parte de lo discutido en este apartado está tomado de los trabajos de John Hutchins, especialmente de y .

source: La major part dels gestor permeten que els termes usats en la definició d'un determinat terme es marquen remissions, és a dir, enllaços actius a les fitxes on es defineixen.
es_es: La mayor parte de los gestores permiten que los términos usados en la definición de un determinado término marquen remisiones, es decir, enlaces activos a las fichas donde se definen.

source: La postedició és convenient quan $$cost({ctraducció automàtica
es_es: La postedición es conveniente cuando $$coste({ctraducción automática

source: La primera demostració pública d'un sistema de TA va ser desenvolupada per IBM i la Universitat Georgetown el 1954.
es_es: La primera demostración pública de un sistema de TA fue desarrollada por IBM y la Universidad Georgetown en 1954.

source: La recerca dicotòmica és només una de les moltes tècniques que es poden fer servir per a accelerar les consultes que es refereixen a un camp ordenat; el programa gestor de bases de dades pot usar una altra tècnica de recerca depenent del seu disseny o del tipus de camp.
es_es: La búsqueda dicotómica es sólo una de las muchas técnicas que se pueden usar para acelerar las consultas que se refieren a un campo ordenado; el programa gestor de bases de datos puede usar otra técnica de búsqueda dependiendo de su diseño o del tipo de campo.

source: La sintaxi es defineix normalment, no en termes de mots, sinó en termes de categories lèxiques.} per mot (normalment una)'', amb ``l'objectiu de produir textos breus i no ambigus'' {AECMA07u}.
es_es: La sintaxis se define normalmente, no en términos de palabras, sino en términos de categorías léxicas.} por palabra (normalmente una)'', con ``el objetivo de producir textos breves y no ambiguos'' {AECMA07u}.

source: La solució elegida (estàndard en sistemes comercials, vegeu {mira98j}, {forcada00p}) es basa en la detecció i el tractament de seqüències predefinides de categories lèxiques (anomenades patrons), és a dir, una mena de sintagmes rudimentaris, com ara { art}--{ nom} o { art}--{ nom}--{ adj}.
es_es: La solución elegida (estándar en sistemas comerciales, véase {mira98j}, {forcada00p}) se basa en la detección y el tratamiento de secuencias predefinidas de categorías léxicas (denominadas patrones), es decir, un tipo de sintagmas rudimentarios, como por ejemplo { arte}--{ nombre} o arte { }--{ nombre}--{ adj}.

source: La taula conté una llista de cognoms ordenats alfabèticament.
es_es: La tabla contiene una lista de apellidos ordenados alfabéticamente.

source: La traducció automàtica (TA) es pot definir com el procés (o el producte) de traduir un text informatitzat un fitxer d'ordinador que conté un text codificat en un format conegut (vegeu el capítol .) } en una llengua origen a un text informatitzat en una llengua meta mitjançant l'ús d'un programa d'ordinador.
es_es: La traducción automática (TA) se puede definir como el proceso (o el producto) de traducir un texto informatizado un fichero de ordenador que contiene un texto codificado en un formato conocido (véase el capítulo .) } en una lengua origen a un texto informatizado en una lengua meta mediante el uso de un programa de ordenador.

source: La traducció automàtica instantània de pàgines web durant la navegació és un cas de traducció automàtica{}
es_es: La traducción automática instantánea de páginas web durante la navegación es un caso de traducción automática{}

source: La traducció automàtica per a la disseminació és especialment eficient quan només es tradueixen textos pertanyents a una part molt reduïda i ben regulada de l'idioma en qüestió (un subllenguatge).
es_es: La traducción automática para la diseminación es especialmente eficiente cuando sólo se traducen textos pertenecientes a una parte muy reducida y muy regulada del idioma en cuestión (un sublenguaje).

source: La traducció automàtica, tot i ser imperfecta, pot ser una eina molt útil en aquests dos grups d'aplicacions.
es_es: La traducción automática, a pesar de ser imperfecta, puede ser una herramienta muy útil en estos dos grupos de aplicaciones.

source: La traducció idiomàtica correcta seria poc més o menys: { Fa molt temps, en una certa illa, vivia un gran porc i se solia menjar la gent.
es_es: La traducción idiomática correcta sería más o menos: { Hace mucho tiempo, en una cierta isla, vivía un gran cerdo y se solía comer la gente.

source: La traducció mitjançant màquines és una ambició humana des de fa segles que no es va fer realitat fins al XX.
es_es: La traducción mediante máquinas es una ambición humana desde hace siglos que no se hizo realidad hasta el XX.

source: La velocitat actual del sistema és de l'ordre de milers de mots per segon sobre un PC estàndard (molt més ràpida que SALT o Ara, que tradueixen a velocitats de l'ordre de desenes de molts per segon).
es_es: La velocidad actual del sistema es de la orden de miles de palabras por segundo sobre un PC estándar (mucho más rápida que SALT o Ara, que traducen a velocidades de la orden de decenas de palabras por segundo).

source: La versió actual d'{ interNOSTRUM} (accessible de forma gratuïta a través d'Internet, {http://www.internostrum.com}) no és encara un producte acabat, però ja pot ser usat per a generar, quasi instantàniament, esborranys de traduccions al català llestes per a ser corregides (posteditades).
es_es: La versión actual de { interNOSTRUM} (accesible de forma gratuita a través de Internet, {http://www.internostrum.com}) no es todavía un producto acabado, pero ya puede ser usado para generar, casi instantáneamente, borradores de traducciones al catalán listas para ser corregidas (posteditadas).

source: Les categories lèxiques (o simplement { categories
es_es: Las categorías léxicas (o simplemente { categorías

source: Les ambigüitats lèxiques no categorials s'aborden amb estratègies { ad hoc} provisionals.
es_es: Las ambigüedades léxicas no categoriales se abordan con estrategias { ad hoc} provisionales.

source: Les imperfeccions de la traducció es poden compensar amb preguntes o dient les coses d'una altra manera fins que els dos interlocutors s'entenguen (és a dir, mitjançant una negociació).
es_es: Las imperfecciones de la traducción se pueden compensar con preguntas o diciendo las cosas de otro modo hasta que los dos interlocutores se entiendan (es decir, mediante una negociación).

source: Les operacions més comunes que es realitzen sobre una base de dades també són similars a aquelles que podem fer amb un fitxer de fitxes de cartolina: Recerques o consultes: buscar un o més registres que compleixen un determinat criteri de búsqueda.
es_es: Las operaciones más comunes que se realizan sobre una base de datos también son similares a aquellas que podemos hacer con un fichero de fichas de cartulina: Investigaciones o consultas: buscar uno o más registros que cumplen un determinado criterio de búsqueda.

source: Les preguntes es poden plantejar com en el problema .
es_es: Las preguntas se pueden plantear como en el problema .

source: Les referències que s'han fet en l'epígraf al propòsit o motivació de la traducció i a la tipologia dels documents que han de ser traduïts són també molt importants a l'hora d'analitzar la traducció automàtica.
es_es: Las referencias que se han hecho en el epígrafe al propósito o motivación de la traducción y a la tipología de los documentos que tienen que ser traducidos son también muy importantes a la hora de analizar la traducción automática.

source: Les regles de l'anglés controlat, poden dependre del sistema de TA elegit?
es_es: Las reglas del inglés controlado, ¿pueden depender del sistema de TA elegido?

source: Les regles es podrien formular com segueix en espanyol:
es_es: Las reglas se podrían formular como sigue en español:

source: Les regles que formuleu per als autors que escriguen en el llenguatge controlat han de estar escrites en $L$ i no han de contenir referències a altres llengues.
es_es: Las reglas que formuleis para los autores que escriban en el lenguaje controlado tienen que estar escritas en $L$ y no tienen que contener referencias a otras lenguas.

source: Les restriccions es poden expressar sota la forma de missatges interactius dirigits a la persona que prepara el document original.
es_es: Las restricciones se pueden expresar bajo la forma de mensajes interactivos dirigidos a la persona que prepara el documento original.

source: Les seqüències considerades pel subprograma en formen el catàleg de patrons.
es_es: Las secuencias consideradas por el subprograma forman el catálogo de patrones.

source: Llengua de contacte que es parla a Papua Nova Guinea i que té 50.000 parlants que la parlen com a primera llengua i més de dos milions de parlants que la parlen com a segona llengua.
es_es: Lengua de contacto que se habla en Papúa Nueva Guinea y que tiene 50.000 hablantes que la hablan como primera lengua y más de dos millones de hablantes que la hablan como segunda lengua.

source: Llenguatges controlats
es_es: Lenguajes controlados

source: Moltes de les aplicacions de la traducció automàtica es poden dividir en dos grans grups: l'assimilació d'informació (quan una persona usa la traducció automàtica per a obtenir informació a partir d'un document escrit en una altra llengua) i la disseminació ---també anomenada difusió--- d'informació (quan una persona usa la traducció automàtica per a produir documents que han de ser distribuïts a més d'un usuari).
es_es: Muchas de las aplicaciones de la traducción automática se pueden dividir en dos grandes grupos: la asimilación de información (cuando una persona usa la traducción automática para obtener información a partir de un documento escrito en otra lengua) y la diseminación ---también llamada difusión--- de información (cuando una persona usa la traducción automática para producir documentos que tienen que ser distribuidos a más de un usuario).

source: Moltes situacions de traducció automàtica es poden classificar com a situacions de CAT, { computer-aided translation} o traducció assistida per ordinador, també anomenada traducció semiautomàtica.
es_es: Muchas situaciones de traducción automática se pueden clasificar como situaciones de CAT, { computer-aided translation} o traducción asistida por ordenador, también llamada traducción semiautomática.

source: Moltes voltes, la preedició la fa l'autor quan interacciona amb el programa de traducció automàtica.
es_es: Muchas veces, la preedición la hace el autor cuando interacciona con el programa de traducción automática.

source: Molts dels fitxers que usen les persones que es dediquen a la traducció són fitxers (o documents) de text de diversos formats, com els descrits en l'epígraf , però també n'hi ha que es corresponen amb el significat del mot fitxer fora de la informàtica: contenen fitxes, totes amb un format més o menys constant; per exemple, totes les fitxes d'un fitxer bibliogràfic contenen informació sobre els autors, el títol, l'any de publicació, etc.
es_es: Muchos de los ficheros que usan las personas que se dedican a la traducción, son ficheros (o documentos ) de texto de varios formatos, como los descritos en el epígrafe , pero también hay algunos que se corresponden con el significado de la palabra fichero fuera de la informática: contienen fichas, todas con un formato más o menos constante; por ejemplo, todas las fichas de un fichero bibliográfico contienen información sobre los autores, el título, el año de publicación, etc.

source: Molts investigadors començaven a trobar barreres de tot tipus, especialment semàntiques, que semblaven massa difícils de superar i que exigien mètodes més complexos.
es_es: Muchos investigadores empezaban a encontrar barreras de todo tipo, especialmente semánticas, que parecían demasiado difíciles de superar y que exigían métodos más complejos.

source: Més concretament l'objectiu del projecte (vigent des de novembre de 1998) és desenvolupar un sistema de traducció automàtica de l'espanyol a les variants estàndards del català i el sistema invers corresponent.
es_es: Más concretamente el objetivo del proyecto (vigente desde noviembre de 1998) es desarrollar un sistema de traducción automática del español a las variantes estándares del catalán y el sistema inverso correspondiente.

source: No feia molt que s'havia creat el primer ordinador, quan ja es va començar a pensar en la possibilitat d'usar-los per a traduir llenguatges humans.
es_es: No hacía mucho que se había creado el primer ordenador, cuando ya se empezó a pensar en la posibilidad de usarlos para traducir lenguajes humanos.

source: No obstant això, algunes veus es pronunciaren en contra del perfeccionisme dominant i defensaren una aproximació més a llarg termini al problema i la construcció de sistemes que feren un ús efectiu de la interacció persona-màquina.
es_es: Sin embargo, algunas voces se pronunciaron en contra del perfeccionismo dominante y defendieron una aproximación más a largo plazo al problema y la construcción de sistemas que hicieran un uso efectivo de la interacción persona-máquina.

source: No és possible.
es_es: No es posible.

source: No, perquè els homògrafs del text origen no afecten el text meta en brut.
es_es: No, porque los homógrafos del texto origen no afectan el texto meta en bruto.

source: Normalment es reserva la denominació traducció automàtica per a la completament automàtica; quan s'hi produeix intervenció humana es parla de { traducció assistida per l'ordinador} o de traducció semi-automàtica.
es_es: Normalmente se reserva la denominación traducción automática para la completamente automática; cuando se produce intervención humana se habla de { traducción asistida por ordenador} o de traducción semiautomática.

source: Normalment, els programes tenen un mòdul inicial que podríem anomenar desformatador i un mòdul final que podríem anomenar reformatador i que restitueix les etiquetes de manera que el format i l'estructura del document es conserven tant com siga possible.
es_es: Normalmente, los programas tienen un módulo inicial que podríamos denominar desformateador y un módulo final que podríamos denominar reformateador y que restituye las etiquetas de forma que el formato y la estructura del documento se conserven tanto como sea posible.

source: Normalment, els usuaris reals no executen un programa gestor de bases de dades universal, sinó que usen programes o aplicacions que simplifiquen la creació, el manteniment i l'ús de la base de dades per a un perfil d'usuari concret.
es_es: Normalmente, los usuarios reales no ejecutan un programa gestor de bases de datos universal, sino que usan programas o aplicaciones que simplifican la creación, el mantenimiento y el uso de la base de datos para un perfil de usuario concreto.

source: O a una combinació de camps, com ara el dia, el mes i l'any que formen una data.
es_es: O a una combinación de campos, como por ejemplo el día, el mes y el año que forman una fecha.

source: Operacions amb bases de dades
es_es: Operaciones con bases de datos

source: Per a acabar aquest apartat, convé esmentar alguns processos que no s'anomenaran traducció en aquest curs: l'adaptació de textos antics a la forma moderna d'un idioma; la traducció de mots i frases quan s'ensenya un nou idioma; la interpretació (de missatges parlats); la codificació (en Morse, etc.).
es_es: Para acabar este apartado, conviene mencionar algunos procesos que no se denominarán traducción en este curso: la adaptación de textos antiguos a la forma moderna de un idioma; la traducción de palabras y frases cuando se enseña un nuevo idioma; la interpretación (de mensajes hablados); la codificación (en Morse, etc.).

source: Per a preeditar correctament cal conéixer l'idioma de destinació.
es_es: Para preeditar correctamente hay que conocer el idioma de destino.

source: Per aquesta època, a més, els sistemes de TA comencen a ser demanats per empreses i administracions i no sols per traduir textos científics i tècnics.
es_es: Por esta época, además, las empresas y administraciones empiezan a pedir los sistemas de TA, y no sólo para traducir textos científicos y técnicos.

source: Per començar, s'ha de tenir en compte que el mot traducció és ambigu perquè es pot referir al procés de traduir o al producte (resultat) d'aquest procés.
es_es: Para empezar, se tiene que tener en cuenta que la palabra traducción es ambigua porque se puede referir al proceso de traducir o al producto (resultado) de este proceso.

source: Per exemple, carta comercial, edicte municipal, comentari editorial, manual tècnic informàtic o recull de poemes.
es_es: Por ejemplo, carta comercial, edicto municipal, comentario editorial, manual técnico informático o compilación de poemas.

source: Per exemple, en anglés tècnic, el mot replace presenta una { ambigüitat lèxica
es_es: Por ejemplo, en inglés técnico, la palabra replace presenta una { ambigüedad léxica

source: Per exemple, en molts casos és difícil aconseguir que l'ordinador sàpia elegir la interpretació correcta entre les possibles interpretacions d'un enunciat ambigu com Els soldats van disparar als xiquets.
es_es: Por ejemplo, en muchos casos es difícil conseguir que el ordenador sepa elegir la interpretación correcta entre las posibles interpretaciones de un enunciado ambiguo como Los soldados dispararon a los niños.

source: Per exemple, moltes memòries de traducció (vegeu el capítol ) inclouen bases de dades terminològiques d'aquesta mena i permeten que la persona usuària les mantinga i les consulte, bé usant un programa independent, o bé des del processador de textos que preferisca.
es_es: Por ejemplo, muchas memorias de traducción (véase el capítulo ) incluyen bases de datos terminológicas de este tipo y permiten que el usuario las mantenga y las consulte, bien usando un programa independiente, o bien desde el procesador de textos que prefiera.

source: Per poder dur a terme la traducció és necessari que els textos del corpus hagen estat alineats prèviament (mitjançant mètodes estadístics o mètodes basats en regles).
es_es: Para poder llevar a cabo la traducción es necesario que los textos del corpus hayan sido alineados previamente (mediante métodos estadísticos o métodos basados en reglas).

source: Per què és necessària la preedició en els sistemes de traducció automàtica?
es_es: ¿Por qué es necesaria la preedición en los sistemas de traducción automática?

source: Per raons polítiques i militars aquestes llengues van ser les elegides per als primers sistemes de TA.
es_es: Por razones políticas y militares, estas lenguas fueron las elegidas para los primeros sistemas de TA.

source: Per rudimentari que siga un sistema de traducció automàtica, pot ser molt útil en tasques d'assimilació.
es_es: Por rudimentario que sea un sistema de traducción automática, puede ser muy útil en tareas de asimilación.

source: Per tant, el sistema semiautomàtic costa només $($0,03$+$0,01$) n = $0,04$ n$ euros, davant dels 0,05$ n$ euros del traductor professional.
es_es: Por lo tanto, el sistema semiautomático cuesta sólo $($0,03$+$0,01$) n = $0,04$ n$ euros, ante los 0,05$ n$ euros del traductor profesional.

source: Per tant, el sistema semiautomàtic costa només 40 euros, davant dels 50 del traductor professional.
es_es: Por lo tanto, el sistema semiautomático cuesta sólo 40 euros, ante los 50 del traductor profesional.

source: Però cal precisar millor què volem dir amb això d'``assistida per ordinador''.
es_es: Pero hay que precisar mejor qué queremos decir con esto de ``asistida por ordenador''.

source: Però la informació emmagatzemada sobre cada terme pot ser molt diferent d'una base de dades a una altra i, per tant, fer servir una base de dades terminològica en diferents sistemes alhora no és una tasca fàcil.
es_es: Pero la información almacenada sobre cada término puede ser muy diferente de una base de datos a otra y, por lo tanto, usar una base de datos terminológica en diferentes sistemas a la vez no es una tarea fácil.

source: Però un dels avantatges més clars de les bases de dades és que permeten que els registres estiguen ordenats per més d'un camp, sense haver de duplicar la base de dades.{
es_es: Pero uno de las ventajas más claras de las bases de datos es que permiten que los registros estén ordenados por más de un campo, sin tener que duplicar la base de datos.{

source: Però un fitxer de fitxes de cartolina només es pot ordenar seguint un únic criteri.
es_es: Pero un fichero de fichas de cartulina sólo se puede ordenar siguiendo un único criterio.

source: Però és comú que els fitxers estiguen ordenats segons un dels seus camps: per exemple, un fitxer bibliogràfic pot estar ordenat pel cognom del primer autor, o per la matèria.
es_es: Pero es común que los ficheros estén ordenados según uno de sus campos: por ejemplo, un fichero bibliográfico puede estar ordenado por el apellido del primer autor, o por la materia.

source: Però, per posar-nos en l'altre extrem, ha de quedar clar que la traducció automàtica pot ser molt útil en aquelles situacions en què l'ús d'un traductor professional siga impracticable o impossible econòmicament.
es_es: Pero, para ponernos en el otro extremo, tiene que quedar claro que la traducción automática puede ser muy útil en aquellas situaciones en que el uso de un traductor profesional sea impracticable o imposible económicamente.
